# Required for vscode to handle logins
gnome-keyring
# Desktop bits
flatpak
# pinta Not available on 24.04
xclip
# peek - No longer working
handbrake
tldr
# boxes - vm gui
boxes

# screen recorder
# kazam no wayland support

# ssh agent manager
keychain
# General bits
bash-completion
bzip2
curl
ca-certificates
diffutils
gcc
git
grep
gzip
unzip
htop
httping
iftop
iotop
less
make
openssl
rsync
tar
wget
whois
zip
jq
zsh
gpg
apt-transport-https
gnupg
ripgrep

#virualisation
gnome-boxes
virt-manager
qemu-system-x86
libvirt-daemon-system
# qemu-efi Not available on 24.04

ruby
python3-pip
python3-venv
build-essential
cmake
libpython3-dev
libdbus-1-dev
libdbus-glib-1-dev
network-manager-openvpn

#notify-send
libnotify-bin
# notify-osd using rotification now

# golang - now installed via PPA ppa:longsleep/golang-backports
golang

polybar
# status bar when in sway, replaces polybar
waybar
cpufrequtils

# moonlander https://github.com/zsa/wally/wiki/Linux-install
libusb-1.0-0-dev

# isolate appimage and other progams
firejail

# Used for pythong clis
pipx 

# video things
#v4l2loopback-dkms

# backup snapshots
timeshift

# cargo deps for coreos-installer
libzstd-dev
libssl-dev

# yubikey pam 
libpam-yubico
libpam-u2f

flameshot
# see https://github.com/regolith-linux/regolith-desktop/issues/920
slurp 
# see https://github.com/flameshot-org/flameshot/blob/master/docs/Sway%20and%20wlroots%20support.md
grim 
# make qt waylayd https://stackoverflow.com/questions/69994530/qt-qpa-plugin-could-not-find-the-qt-platform-plugin-wayland
qtwayland5

# clipboard history
copyq

# nslookup and tools
dnsutils

# media player
vlc

# emoji font for albert and gtk apps on popos
# see: https://www.reddit.com/r/pop_os/comments/gnh2g7/enable_color_emojis_in_pop_os/
fonts-noto-color-emoji

# packages for keymapp to flash moonlander 
libwebkit2gtk-4.1-0
libgtk-3-0
libusb-1.0-0

# sway logout
wlogout

# sway screen recorder
wf-recorder

# application launcher
ulauncher

# used by ulauncher plugins
python3-fuzzywuzzy
python3-cachetools

# mainline for kernel updates
mainline

# better htop
btop

# support virtfs in vm
virtiofsd