
# Terminal stuff
brew "wezterm"
brew "jq"
brew "starship"
brew "htop"
brew "chezmoi"
brew "gh"
brew "atuin"
brew "ripgrep"
brew "z"
# kube bits
brew "kubectx"
brew "k9s"
# File manager for terminal stuff
brew "yazi"
# ls replacement
brew "eza"
# cat replacement
brew "bat"
# nano replacement
brew "micro"
# interactive jq
brew "jid"