ms-vscode-remote.vscode-remote-extensionpack
2gua.rainbow-brackets
ms-python.python
oderwat.indent-rainbow
redhat.vscode-yaml
alvesvaren.arc-dark
ms-vsliveshare.vsliveshare-pack
mattlott.copy-github-url
davidlday.languagetool-linter
eamodio.gitlens
github.codespaces
