# Signal desktop
org.signal.Signal
# Remote desktop
org.remmina.Remmina
# Rest testing tool
rest.insomnia.Insomnia
io.github.mimbrero.WhatsAppDesktop
# libvirt vm manager
org.gnome.Boxes
# video editor
org.pitivi.Pitivi

# ~~Nov2024: Screen share issues in deb moving back to flatpak~~ nope
# Flatpak install has graphics issue, moved to deb for a bit
# us.zoom.Zoom

# apple music player
#edge browser
com.microsoft.Edge

tv.plex.PlexDesktop

org.flameshot.Flameshot

net.hovancik.Stretchly
# cpu temp tracker
org.coolero.Coolero
org.onlyoffice.desktopeditors

# Backups
org.gnome.DejaDup

com.github.tchx84.Flatseal
org.kde.kalk
com.discordapp.Discord
# Element matrix client
# im.riot.Riot -> Moved to apt package as kept losing local state

# com.slack.Slack favour the deb installer
io.missioncenter.MissionCenter
# scren recorder
sa.sy.bluerecorder

# Notes and journaling
com.logseq.Logseq

# Paint.net replacement
com.github.PintaProject.Pinta

# postman alternative
io.httpie.Httpie